# Tips & Trick Pandas Data Frame

## 11. Melakukan seleksi kolom dan baris pada Data Frame menggunakan .loc

### Import Module

In [1]:
import pandas as pd
import numpy as np

### Persiapan Data Frame

In [2]:
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1, 20, size=(10, 5)),
                 columns=cols)
df

    A   B   C   D   E
0  15  12   5  15   2
1  12   2  18   9  11
2   4   5  16  10   2
3  15   4   6  17   8
4  11  12  12  17  12
5  17   8   5  18  19
6  10  15  19   4   8
7   4  18  16   3   3
8  14   3  13  18   8
9   3  19   4  14  14

### Seleksi kolom dan baris menggunakan .loc

In [3]:
df.loc[[0,3,4],['B','E']]

    B   E
0  12   2
3   4   8
4  12  12

### Seleksi baris dengan kondisi

In [4]:
df.loc[df['B']>10, ['B','D','E']]

    B   D   E
0  12  15   2
4  12  17  12
6  15   4   8
7  18   3   3
9  19  14  14

### Slicing Data Frame dengan .loc

In [5]:
df.loc[0:4, 'B':'D']

    B   C   D
0  12   5  15
1   2  18   9
2   5  16  10
3   4   6  17
4  12  12  17

## 12. Membentuk kolom bertipe Datetime dari sejumlah kolom lain pada Data Frame

### Import Module

In [6]:
import pandas as pd

### Persiapan Data Frame

In [7]:
data = {'day':[1,2,10,25,12],
       'month':[1,2,4,5,6],
       'year':[2000,2001,2010,2015,2020]}

df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

### Membentuk kolom bertipe Datetime

In [15]:
df['tanggal'] = pd.to_datetime(df[['day','month','year']])
df

   day  month  year    tanggal
0    1      1  2000 2000-01-01
1    2      2  2001 2001-02-02
2   10      4  2010 2010-04-10
3   25      5  2015 2015-05-25
4   12      6  2020 2020-06-12

In [16]:
df.dtypes

day                 int64
month               int64
year                int64
tanggal    datetime64[ns]
dtype: object

## 13. Konversi nilai numerik ke dalam sejumlah kategori

### Import Module

In [17]:
import pandas as pd
import numpy as np

### Persiapan Data Frame

In [19]:
cols = ('usia',)
df = pd.DataFrame(np.random.randint(1, 99, size=(10, 1)),
                 columns=cols)
df

   usia
0    33
1    53
2    16
3    24
4     4
5    76
6    35
7    79
8    72
9    71

### Pengelompokan nilai numerik ke dalam beberapa kategori menggunakan .cut()

In [20]:
df['kelompok_usia'] = pd.cut(df['usia'],
                            bins =[0, 18, 65, 99],
                            labels =['anak','dewasa','manula'])
df

   usia kelompok_usia
0    33        dewasa
1    53        dewasa
2    16          anak
3    24        dewasa
4     4          anak
5    76        manula
6    35        dewasa
7    79        manula
8    72        manula
9    71        manula

## 14. Menggabungkan (merge) dua Data Frame

### Import Module

In [21]:
import pandas as pd
import numpy as np

### Persiapan Data Frame

In [22]:
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1, 20, size=(5, 5)),
                 columns=cols)
df

    A   B   C   D   E
0   2  10  15  11  18
1  13  17   5   2  18
2   3  10   7  19   2
3   6   8  14   2  11
4   5  13   6   3   1

In [23]:
df1 = df.copy(deep=True)
df1 = df1.drop([1,4])
df1

   A   B   C   D   E
0  2  10  15  11  18
2  3  10   7  19   2
3  6   8  14   2  11

In [24]:
df2 = df.copy(deep=True)
df2 = df2.drop([0,3])
df2

    A   B  C   D   E
1  13  17  5   2  18
2   3  10  7  19   2
4   5  13  6   3   1

### Menggabungkan dua Data Frame

In [25]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

   A   B  C   D  E
0  3  10  7  19  2

In [26]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0   2  10  15  11  18
1   3  10   7  19   2
2   6   8  14   2  11
3  13  17   5   2  18
4   5  13   6   3   1

## 15. Memecah nilai string dari suatu kolom ke dalam beberapa kolom baru

### Import Module

In [27]:
import pandas as pd

### Persiapan Data Frame

In [28]:
data = {'nama':['Didi Kempot','Glenn Fredly','Mbah Surip'],
       'tempat_kelahiran':['Surakarta, Jawa Tengah','Jakarta, DKI Jakarta','Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

           nama        tempat_kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur

### Memecah nama depan dan nama belakang

In [29]:
df[['nama_depan','nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama        tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

In [30]:
df[['kota','provinsi']] = df['tempat_kelahiran'].str.split(', ', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,provinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

## 16. Menata ulang Data Frame dengan multiple indexes menggunakan .unstack()

### Import Module

In [31]:
import pandas as pd

### Persiapan Data Frame

In [32]:
df = pd.read_csv('titanic.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### Data Frame dengan multiple indexes dari hasil groupping

In [35]:
df.groupby(['sex','pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

### Menata ulang Data Frame dengan multiple indexes

In [36]:
df.groupby(['sex','pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

## 17. Resampling pada data deret waktu (Time Series Dat)

### Import Module

In [37]:
import pandas as pd
import numpy as np

### Persiapan Data Frame

In [38]:
n_rows = 365 * 24
n_cols = 2
cols = ['cols1','cols2']
df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df

E:\Phython\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                     cols1  cols2
2000-01-01 00:00:00      4      9
2000-01-01 01:00:00     12      1
2000-01-01 02:00:00      2     18
2000-01-01 03:00:00     16     12
2000-01-01 04:00:00      1     14
...                    ...    ...
2000-12-30 19:00:00     18      2
2000-12-30 20:00:00      9      8
2000-12-30 21:00:00      8      4
2000-12-30 22:00:00      2      8
2000-12-30 23:00:00      2     14

[8760 rows x 2 columns]

### Resampling data dengan interval monthly

In [40]:
df.resample('M')['cols1'].sum().to_frame()

            cols1
2000-01-31   7654
2000-02-29   6958
2000-03-31   7275
2000-04-30   7082
2000-05-31   7307
2000-06-30   7277
2000-07-31   7372
2000-08-31   7287
2000-09-30   7133
2000-10-31   7499
2000-11-30   7384
2000-12-31   7236

### Resampling data dengan interval daily

In [41]:
df.resample('D')['cols1'].sum().to_frame()

            cols1
2000-01-01    215
2000-01-02    266
2000-01-03    260
2000-01-04    196
2000-01-05    284
...           ...
2000-12-26    260
2000-12-27    239
2000-12-28    247
2000-12-29    239
2000-12-30    225

[365 rows x 1 columns]

## 18. Membentuk Dummy Data Frame

### Import Module

In [42]:
import pandas as pd
import numpy as np

### Membentuk Data Frame dari Dictionary

In [43]:
pd.DataFrame({'col1':[1,2,3,4],
             'cols2':[5,6,7,8]})

   col1  cols2
0     1      5
1     2      6
2     3      7
3     4      8

### Membentuk Data Frame dari Numpy Array

In [44]:
n_rows = 5
n_cols = 3

arr = np.random.randint(1, 20, size=(n_rows, n_cols))
arr

array([[18, 17, 13],
       [12, 19,  4],
       [ 6, 12,  1],
       [11,  6,  5],
       [ 5, 17,  8]])

In [45]:
pd.DataFrame(arr, columns=tuple('ABC'))

    A   B   C
0  18  17  13
1  12  19   4
2   6  12   1
3  11   6   5
4   5  17   8

### Membentuk Data Frame dengan memanfaatkan pandas.util.testing

In [46]:
pd.util.testing.makeDataFrame().head()

                   A         B         C         D
PZQp7AaqyG -0.196031 -0.371185 -1.278308  0.390945
jpJOVF4fUU  0.951290 -0.016730 -0.350068 -1.361544
pMBbzbStgm -0.644307  1.892600 -0.622906 -0.398522
BwGd37PmY5  0.009392  0.638260  0.812346 -0.790147
amgFcp0Juw -0.945952 -1.337463  0.396644  0.470135

In [47]:
pd.util.testing.makeMixedDataFrame().head()

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [48]:
pd.util.testing.makeTimeDataFrame().head()

                   A         B         C         D
2000-01-03 -2.345201 -2.390399 -0.739378 -0.619492
2000-01-04 -0.808023 -1.600474  0.450608 -1.819533
2000-01-05  0.098261  1.165017 -0.397731 -1.588115
2000-01-06 -0.396154  0.189728 -1.059227  0.315472
2000-01-07 -0.306160 -0.587552  0.487592 -0.890144

In [50]:
pd.util.testing.makeMissingDataframe().head()

                   A         B         C         D
DIZFweAchc  2.049627 -0.850607  0.296212  0.198373
cMpXAKFi3C -0.651282       NaN  0.834527  1.880631
Z1qxFnIIXr -0.934350  1.517181  2.498464 -0.465914
4gKn97rQkq -0.233389 -1.953904  1.752349 -0.267251
cNAPoQkZSs -0.707511  0.884955  0.710239 -1.138822

## 19. Formatting tampilan Data Frame

### Import Module

In [51]:
import pandas as pd
import numpy as np

### Persiapan Data Frame

In [52]:
n_rows = 5
n_cols = 2
cols = ['omset','operasional']
df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df

   omset  operasional
0      7           16
1      5            5
2     13           15
3     18           15
4     10           17

In [54]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0   700000       160000
1   500000        50000
2  1300000       150000
3  1800000       150000
4  1000000       170000

In [55]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operasional
0 2000-01-01   700000       160000
1 2000-01-02   500000        50000
2 2000-01-03  1300000       150000
3 2000-01-04  1800000       150000
4 2000-01-05  1000000       170000

### Melakukan Formatting tampilan Data Frame

In [62]:
formatku = {'tanggal':'{:%d/%m/%y}',
           'operasional':'Rp {:.2f}',
           'omset':'Rp {:.2f}'}
laporan = df.style.format(formatku)
laporan

In [58]:
type(laporan)

pandas.io.formats.style.Styler

In [59]:
laporan.hide_index()

In [60]:
laporan.set_caption('Data Omset dan Operasional')

In [65]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')

## 20. Menggabungkan (merge) dua Data Frame secara berdampingan

### Import Module

In [ ]:
import pandas as pd

### Persiapan Data Frame

In [66]:
d1 = {'col1':[1,2,3],
     'col2':[10, 20, 30]}
df1 = pd.DataFrame(d1)
df1

   col1  col2
0     1    10
1     2    20
2     3    30

In [67]:
d2 = {'col3':[4,5,6],
     'col4':[40, 50, 60]}
df2 = pd.DataFrame(d2)
df2

   col3  col4
0     4    40
1     5    50
2     6    60

### Menggabungkan (merge) dua Data Frame secara berdampingan

In [71]:
df = pd.merge(df1, df2, left_index=True, right_index=True)
df

   col1  col2  col3  col4
0     1    10     4    40
1     2    20     5    50
2     3    30     6    60